{
  "backend/main.mo": "Motoko canister storing plant entries with CRUD operations, ID generation, and name-sorted retrieval.",
  "feature_evidence.json": "Metadata describing a feature request for adding a soil-type filter to the plant entry list UI with related files and components.",
  "frontend-file-summaries.txt": "JSON-style mapping of frontend file paths to short descriptions of their roles in the app.",
  "frontend/index.css": "Tailwind base layer defining CSS variables for theming, including light and dark mode color tokens.",
  "frontend/index.html": "Basic HTML shell loading the React app root and main script.",
  "frontend/src/App.tsx": "Root React component rendering header, plant entry list, footer, and global toaster with background pattern.",
  "frontend/src/components/plant-entries/PlantEntryCard.tsx": "Card UI showing a plant entry’s main details including planting date, germination status, light hours, and soil type.",
  "frontend/src/components/plant-entries/PlantEntryDetail.tsx": "Detail dialog for viewing, editing, and deleting a plant entry with germination info and confirmation dialogs.",
  "frontend/src/components/plant-entries/PlantEntryForm.tsx": "Form component for creating or editing a plant entry with validation and mutation handling.",
  "frontend/src/components/plant-entries/PlantEntryList.tsx": "Displays a list of plant entries with soil-type filtering, loading and error states, and controls for viewing or adding entries.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and invalidates related queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and loading identities from storage.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on plant entries using the backend actor.",
  "frontend/src/index.css": "Sets Tailwind base styles and theme variables using OKLCH earth-tone color tokens and global typography.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/utils/time.ts": "Contains helpers for converting between backend Time values and date strings, formatting dates, and computing day differences.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and container settings using OKLCH variables.",
  "project_state.json": "Stores project metadata, existing features, and new feature requests for a seed-tracking app. Includes schema versioning, project notes, and detailed feature definitions."
}